//_____________________________________________________________________Introduction_________________________________________________________
/*
ইমপ্লিসিট টাইপ কাস্টিং (Implicit Type Casting) বা টাইপ কোয়ের্সন (Type Coercion) হলো জাভাস্ক্রিপ্টের একটি প্রক্রিয়া, 
যেখানে জাভাস্ক্রিপ্ট স্বয়ংক্রিয়ভাবে একটি ডেটাটাইপকে অন্য একটি ডেটাটাইপে রূপান্তর করে ফেলে। 
এটি সাধারনত তখন ঘটে যখন দুইটি ভিন্ন টাইপের ভ্যালু একসাথে ব্যবহার করা হয়।

জাভাস্ক্রিপ্টে সাধারণত দুই ধরণের টাইপ কাস্টিং আছে:
1. ইমপ্লিসিট টাইপ কাস্টিং: ব্রাউজার বা জাভাস্ক্রিপ্ট ইঞ্জিন স্বয়ংক্রিয়ভাবে ডেটাটাইপ পরিবর্তন করে ফেলে।
2. এক্সপ্লিসিট টাইপ কাস্টিং: ডেভেলপার নিজে টাইপ কাস্টিং করে।
*/






//__________________________________________________________________Implicit Type Casting_____________________________________________________
/*
let result1 = 5 + "10";
console.log(result);                     // "510"


let result2 = 5 * "10";
console.log(result);                     // 50


let result3 = true + 2;
console.log(result);                     // 3


let result4 = "" + 4;
console.log(result);                     // "4"
*/




//_________________________________________________________________Important Notes__________________________________________________________
/*
1. যোগ (addition) অপারেশনে স্ট্রিং থাকলে জাভাস্ক্রিপ্ট সংখ্যাকে স্ট্রিংয়ে কনভার্ট করে।
2. বিয়োগ, গুণ এবং ভাগ অপারেশনে জাভাস্ক্রিপ্ট স্ট্রিংয়ের মধ্যে সংখ্যা থাকলে তা সংখ্যায় কনভার্ট করে।
*/


console.log("5" - 2);       // 3
console.log("5" * "2");      // 10
console.log("5" / "2");      // 2.5
console.log("5" + 2);        // "52"
console.log(true + 1);       // 2
console.log(false + 10);     // 10
console.log(null + 1);       // 1
console.log(undefined + 1);  // NaN